package Ch07;


public class C00While_Test {

	
	public static void main(String[] args) {
		// TODO Auto-generated method stub

		// N - M 까지의 합을 구합니다.(N<M)
		//01 1 - N 까지 수중에 짝수/홀수의 합을 각각 출력
		//1 - N 까지 수중에 3의 배수만 출력하고 그합도 출력
		//1 - N까지 수중에 4의 배수를 출력하고 4의배수가 아닌 나머지의 합을 구하세요
		//구구단 N 단 역순출력(N<=9)
		
		//양의 정수를 입력받아서 소수인지 아닌지를 판별하는 코드를 작성하세요
		
	
		//숫자를 입력받아 해당 수를 거꾸로 저장해서 출력해보세요
		//정수값을 입력받아서 처리합니다
		//입력 : 1234
		//출력 : 4321


		// 이중 while문제.. 나중에 푸세요~~
		//자연수 n을 입력받아 "출력 예"와 같이 n x n크기에 공백으로 구분하여 출력되는 프로그램을 작성하시오. 
		//10 미만의 홀수만 출력하시오.
		// 주의! 숫자는 공백으로 구분하되 줄사이에 빈줄은 없다.
		//입력 : 3
		//출력 :
		//1 3 5
		//7 9 1
		//3 5 7
		
		
	}

}
